//
// Created by 33503 on 24-9-30.
//
#include<iostream>
#include"calculator.h"
using namespace std;

int relation(char c1, char c2) {
    char cha[7]={'+', '-', '*', '/', '(', ')', '#'}; //让每个运算符对应一个数组下标作为序号
    int relation[7][7]={{1,1,-1,-1,-1,1,1}, {1,1,-1,-1,-1,1,1},
              {1,1,1,1,-1,1,1}, {1,1,1,1,-1,1,1},
              {-1,-1,-1,-1,-1,0,5},{1,1,1,1,5,1,1},
              {-1,-1,-1,-1,-1,5,0}}; //对应cha数组的运算符序号，建立运算符的优先度关系
    //1、0、-1分别代表>、=、<
    //（0，1）=1 代表'+'比'-'优先度高

    int i1,i2;
    for(int i=0; i<7; i++) {
        if(c1==cha[i]) i1=i;
        if(c2==cha[i]) i2=i;
    //查询两个输入运算符的对应序号并记录
    }
    return relation[i1][i2]; //根据序号返回优先度关系
}
